[
    {
        "id": 0,
        "position": "Developer Full stack",
        "place": "📌 Jimbo",
        "date": "Diciembre 2024 - Septiembre 2025.",
        "description": "Me incorporé a una plataforma educativa sobre bienestar estudiantil, trabajando junto a los fundadores en la mejora del producto. Refactoricé la arquitectura del frontend y mejoré la organización del código, además de desarrollar funcionalidades como CRUD de perfiles, reservas, pagos con PayPal y gráficas. Guíe a un dev más junior en buenas prácticas y organización del trabajo, lo que ayudó a mantener la calidad y consistencia del proyecto.",
        "link": null
    },
    {
        "id": 1,
        "position": "Principal Developer Frontend",
        "place": "📌 Seemple Studio",
        "date": "Enero 2024 - marzo 2025.",
        "description": "Desde el inicio del proyecto, hoy en funcionamiento en varios países, con un rol clave en el desarrollo y la organización del trabajo. Colaboré junto a backend y diseño en funcionalidades como CRUD de usuarios, presupuestos, formularios con geolocalización y tracking en tiempo real. Más allá de la etapa inicial, sigo colaborando en mejoras y mantenimiento, aportando valor de forma continua.",
        "link": null
    },
    {
        "id": 3,
        "position": "Developer Frontend",
        "place": "Tienda de pedidos | Cliente directo",
        "date": "Diciembre 2023.",
        "description": "Un cliente necesitaba una web para mostrar sus productos y recibir pedidos por WhatsApp. Desarrollé la tienda con Next.js, integrando un sistema que gestiona productos a partir de un archivo Excel. Implementé un carrito de compras que permite a los usuarios seleccionar productos y cantidades, enviando toda la información directamente al WhatsApp del cliente.",
        "link": "https://tienda-jdum.vercel.app/"
    },
    {
        "id": 4,
        "position": "Principal Frontend Developer",
        "place": "📌 Seemple Studio",
        "date": "Marzo - noviembre de 2023. ",
        "description": "Desde el inicio hasta la conclusión del proyecto, formé parte activa del equipo utilizando: Next.js, Tailwind, Hook Form y Docker como tecnologías clave en el desarrollo. Trabajando bajo metodologías ágiles SCRUM, centrándome en implementar funcionalidades esenciales y adaptándome con destreza a las cambiantes necesidades del proyecto.",
        "link": null
    }
]